Courses/7140/Lectures/Requirements/index.org
# -*- mode: org -*-
#+DATE: 2017-02-24
#+TITLE: Requirements
#+AUTHOR: Prabhaker Mateti
#+DESCRIPTION: Software Engineering
#+HTML_LINK_UP: ../
#+HTML_LINK_HOME: ../../
#+HTML_HEAD: <style> P {text-align: justify} code, pre {color: brown;} @media screen {BODY {margin: 10%} }</style>
#+BIND: org-html-preamble-format (("en" "<a href=\"../../\"> ../../</a>"))
#+BIND: org-html-postamble-format (("en" "<hr size=1>Copyright &copy; 2016 %e &bull; <a href=\"http://www.wright.edu/~pmateti\"> www.wright.edu/~pmateti</a>  %d"))
#+STARTUP:showeverything
#+OPTIONS: toc:nil

* Overview

1. Requirements describe the software project at its conception.  A
   Requirements Document is written from the users perspective.  In
   fact, it is good idea to actually write a first draft of a Users
   Manual and include it as an appendix.  It justifies why it is
   worthwhile to do it.

1. In large projects, requirements elicitation is a major and
   difficult task. Often requirements become clearer after a prototype
   has been built.

1. Related terms: Requirements Definition, Requirements Specification,
   Requirements Elicitation, Requirements Analysis.

* Domain Modeling

1. Unless the project topic is well known, such as editors, compilers,
   etc., requirements should explain where it is coming from.

1. "Domain Modeling is a way to describe and model real world entities
   and the relationships between them, which collectively describe the
   problem domain space."

   1. Consider en embedded system that is going to observe and control
      a chemical reaction.  The model consists of Chemistry, the
      Sensors, the Observations, ...

   1. An interactive geometry construction set.

   1. A CAD program.
   1. Domain modeling of [[../Design/famous-spec-design.html][Knuth's Common Words Problem]] 
   2. Domain modeling of Rename PDF Files
3. https://en.wikipedia.org/wiki/Domain_model Not so clearly explained.
1. https://martinfowler.com/eaaCatalog/domainModel.html A little too
   "dogmatic".

* Domain Modeling of Batch Rename PDF files

1. The problem domain of "Rename Academic Papers" is moderately
   ill-defined.  For example, what are these?

   1. The subject classification.
   2. The year of publication.
   3. List of author names (First Middle Last).
   4. Names of conference or journal of publication.
   5. Names of a file.

5. Obviously these are strings of ASCII characters.  Beyond that do we
   a clear understanding?

1. Notion of accurate re-naming

1. Qualitative or quantitative ("how much") control of the client
   desires
      
* Misc

1. [[./wicked-problems.org][Wicked Problems, Requirements]]

* End
# Local variables:
# after-save-hook: org-html-export-to-html
# end:
