Courses/7140/Lectures/Requirements/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Requirements</title>
<!-- 2018-10-28 Sun 23:50 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="Software Engineering"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Requirements</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Requirements describe the software project at its conception.  A
Requirements Document is written from the users perspective.  In
fact, it is good idea to actually write a first draft of a Users
Manual and include it as an appendix.  It justifies why it is
worthwhile to do it.
</li>

<li>In large projects, requirements elicitation is a major and
difficult task. Often requirements become clearer after a prototype
has been built.
</li>

<li>Related terms: Requirements Definition, Requirements Specification,
Requirements Elicitation, Requirements Analysis.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Domain Modeling</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Unless the project topic is well known, such as editors, compilers,
etc., requirements should explain where it is coming from.
</li>

<li>"Domain Modeling is a way to describe and model real world entities
and the relationships between them, which collectively describe the
problem domain space."

<ol class="org-ol">
<li>Consider en embedded system that is going to observe and control
a chemical reaction.  The model consists of Chemistry, the
Sensors, the Observations, &#x2026;
</li>

<li>An interactive geometry construction set.
</li>

<li>A CAD program.
</li>
<li>Domain modeling of <a href="../Design/famous-spec-design.html">Knuth's Common Words Problem</a> 
</li>
<li>Domain modeling of Rename PDF Files
</li>
</ol>
</li>
<li><a href="https://en.wikipedia.org/wiki/Domain_model">https://en.wikipedia.org/wiki/Domain_model</a> Not so clearly explained.
</li>
<li><a href="https://martinfowler.com/eaaCatalog/domainModel.html">https://martinfowler.com/eaaCatalog/domainModel.html</a> A little too
"dogmatic".
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Domain Modeling of Batch Rename PDF files</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>The problem domain of "Rename Academic Papers" is moderately
ill-defined.  For example, what are these?

<ol class="org-ol">
<li>The subject classification.
</li>
<li>The year of publication.
</li>
<li>List of author names (First Middle Last).
</li>
<li>Names of conference or journal of publication.
</li>
<li>Names of a file.
</li>
</ol>
</li>

<li>Obviously these are strings of ASCII characters.  Beyond that do we
a clear understanding?
</li>

<li>Notion of accurate re-naming
</li>

<li>Qualitative or quantitative ("how much") control of the client
desires
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Misc</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="./wicked-problems.html">Wicked Problems, Requirements</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> End</h2>
<div class="outline-text-2" id="text-5">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2017-02-24
</div>
</body>
</html>
